trade_items = {
    'normal': [{'name': '絲綢'}],
    'material': [{'name': '發光藍鑄塊'}],
    1: [
        {'name': '蓮花', 'img': '蓮花.png'}, {'name': '火藥', 'img': '火藥.png'}, {'name': '土', 'img': '土.png'},
        {'name': '豌豆', 'img': '豌豆.png'}, {'name': '金沙', 'img': '金沙.png'}, {'name': '櫻桃', 'img': '櫻桃.png'},
        {'name': '壁畫', 'img': '壁畫.png'}, {'name': '罈子', 'img': '罈子.png'},
        {'name': '生魚片', 'img': '生魚片.png'},
        {'name': '木筏', 'img': '木筏.png'}, {'name': '海鷗', 'img': '海鷗.png'}, {'name': '糧食', 'img': '糧食.png'},
        {'name': '魚骨', 'img': '魚骨.png'}, {'name': '玫瑰', 'img': '玫瑰.png'}],
    2: [{'name': '海膽', 'img': '海膽.png'},
        {'name': '海賊金幣', 'img': '海賊金幣.png'}, {'name': '觸鬚', 'img': '觸鬚.png'},
        {'name': '救援品', 'img': '救援品.png'}, {'name': '石塔', 'img': '石塔.png'},
        {'name': '海參', 'img': '海參.png'}, {'name': '石板', 'img': '石板.png'}, {'name': '牡蠣', 'img': '牡蠣.png'},
        {'name': '寄居蟹', 'img': '寄居蟹.png'}, {'name': '飲用水', 'img': '飲用水.png'},
        {'name': '五色珠', 'img': '五色珠.png'}, {'name': '海賊旗', 'img': '海賊旗.png'},
        {'name': '克羅恩', 'img': '克羅恩.png'}, {'name': '便當', 'img': '便當.png'}],
    3: [{'name': '藍光蠟燭', 'img': '藍光蠟燭.png'}, {'name': '指令書', 'img': '指令書.png'},
        {'name': '網', 'img': '網.png'}, {'name': '藥草堆', 'img': '藥草堆.png'},
        {'name': '骷髏地毯', 'img': '骷髏地毯.png'}, {'name': '皮外套', 'img': '皮外套.png'},
        {'name': '血液', 'img': '血液.png'}, {'name': '半月刀', 'img': '半月刀.png'},
        {'name': '茶杯', 'img': '茶杯.png'}, {'name': '鐘乳石片', 'img': '鐘乳石片.png'},
        {'name': '望遠鏡', 'img': '望遠鏡.png'}, {'name': '補給箱', 'img': '補給箱.png'},
        {'name': '藏寶圖', 'img': '藏寶圖.png'}, {'name': '沙漏', 'img': '沙漏.png'}],
    4: [{'name': '海賊鑰匙', 'img': '海賊鑰匙.png'}, {'name': '青銅燭台', 'img': '青銅燭台.png'},
        {'name': '斷頸龍象', 'img': '斷頸龍象.png'}, {'name': '靈丹', 'img': '靈丹.png'},
        {'name': '貝殼', 'img': '貝殼.png'}, {'name': '金幣箱', 'img': '金幣箱.png'},
        {'name': '修煉書', 'img': '修煉書.png'}, {'name': '青綠鹽塊', 'img': '青綠鹽塊.png'},
        {'name': '熔岩', 'img': '熔岩.png'}, {'name': '騎士槍', 'img': '騎士槍.png'},
        {'name': '紫水晶', 'img': '紫水晶.png'}, {'name': '五彩線團', 'img': '五彩線團.png'},
        {'name': '海賊短刀', 'img': '海賊短刀.png'}, {'name': '騎士頭盔', 'img': '騎士頭盔.png'}],
    5: [{'name': '岩石', 'img': '岩石.png'}, {'name': '布料', 'img': '布料.png'},
        {'name': '青春靈藥', 'img': '青春靈藥.png'}, {'name': '肖像畫', 'img': '肖像畫.png'},
        {'name': '黃金草', 'img': '黃金草.png'}, {'name': '魚鱗', 'img': '魚鱗.png'},
        {'name': '幼蟲', 'img': '幼蟲.png'}, {'name': '金龍雕像', 'img': '金龍雕像.png'},
        {'name': '黃金燭台', 'img': '黃金燭台.png'}, {'name': '雕像之淚', 'img': '雕像之淚.png'},
        {'name': '弄蝶標本', 'img': '弄蝶標本.png'}, {'name': '藍光石英', 'img': '藍光石英.png'},
        {'name': '37年', 'img': '37年.png'}, {'name': '保管箱', 'img': '保管箱.png'}]}

island_position = {
    '伊利亞': (0, 0),
    '泰亞莫': (-42, -13),
    '西歐尼': (-40, -12),
    '莫德里': (-38, -12),
    '巴艾加': (-37, -12),
    '西路卡': (-33, -12),
    '藍迪斯': (-34, -10),

    '拉麥達': (-41, -8),
    '今貝雷': (-38, -8),

    '戴特恩': (-36, -4),
    '奈特尼恩': (-35.5, -5.5),
    '奧波恩': (-34, -4),
    '德恩特': (-33, -6),
    '艾波迪恩': (-32, -5),
    '阿爾波雷斯': (-30, -7),
    '巴拉培': (-30, -8),

    '泰絲特': (-36, 2),
    '阿爾麥': (-34, 4),
    '皮尼斯': (-31, 4),
    '庫伊特': (-32, 6),
    '阿利塔': (-24, 4),
    '里斯茲': (-24, 0),
    '露露波': (-23, -3),
    '馬路卡': (-21, -2),
    '納勒柏': (-21, 1),
    '斯泰藍': (-25, -4),

    '茵巴德恩': (-17, 2),
    '土路': (-15, 3),
    '奧魯普斯': (-12, 3),
    '洋朱': (-17, -3),
    '巴貝茲': (-15, -1),
    '瑪魯雷斯': (-13, -1),
    '艾貝特': (-14.5, -3.5),
    '杜胡': (-15, -5),

    '馬里貝諾': (-11, -3),
    '路易巴斯': (-12, -6),
    '艾普戴倫': (-9, -7),

    '塔蘇': (-17, 10),
    '雷瑪': (-12, 7),

    '拉西德': (-5, 8),
    '阿爾納哈': (-7, 6),
    '阿茲魯': (-4, 3),

    '巴雷米': (-9, 1),
    '維亦塔': (-7, -1),
    '肯貝拉': (-4, -2),
    '帕拉塔': (-6, -4),
    '阿拉吉爾': (-3, -3),
    '歐斯特拉': (0, -4),
    '塔拉穆拉': (-1, -5),
    '貝盧瓦': (-4, -7),

    '普價拉': (7, 1),
    '戴林哈特': (4, -5),
    '珀爾巴拉': (7, -5),

    '莎莎': (8, 9),
    '羅茲班': (10, 9),
    '普勒泰南': (9, 12),
    '雷拉歐': (8, 16),
    '庭貝拉': (5, 15),

    '索寇塔': (12, -8),
    '里埃': (15, -6),

    '艾史帕': (18, -3),
    '薛納': (19, -1),
    '堤葛黎史': (17, -1),

    '奧利沙': (18, 4),
    '寶雅': (17, 6),

    '赫爾馬': (26, 3),
    '卡修麻': (27, 5),

    '貝村': (-10, -11),
    '艾港': (-32, -15),
    '澳眼': (-12, 20),
}

default_ship_load_capacity = 12991
default_remain_swap_cost = 1000000
default_swap_cost = 11180
default_amount = 1

level_colors = {
    "normal": (255, 247, 217),
    1: (161, 161, 161),
    2: (109, 132, 17),
    3: (64, 150, 193),
    4: (170, 130, 63),
    5: (209, 103, 90),
    "material": (105, 90, 209)
}
